E2EClient/request/1485168877/01_option_update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<m:assetComponent xmlns:m="http://webservice">
<m:AssetComponentIN>
        <m1:OrganizationCode>500</m1:OrganizationCode>
        <m1:CustomerCode>1485168799503C_POM2M</m1:CustomerCode>
        <m1:BillingAccountId>SUB_1485168799503R_POM2M</m1:BillingAccountId>
        <m1:Product>
          <m1:SOId>1</m1:SOId>
          <m1:RootInstanceId>1485168799503R_POM2M</m1:RootInstanceId>
          <m1:ParentInstanceId>1485168799503R_POM2M</m1:ParentInstanceId>
          <m1:ProductInstanceId>1485168877737R_01</m1:ProductInstanceId>
          <m1:ActionCode>Update</m1:ActionCode>
          <m1:ActionType />
          <m1:LineNumber />
          <m1:ProductCatalogId>6021</m1:ProductCatalogId>
	<m1:ServiceId></m1:ServiceId>      
          <m1:TariffId>101</m1:TariffId>
          <m1:StartDate></m1:StartDate>
          <m1:ModifyDate>01/23/2017 11:55:11</m1:ModifyDate>
          <m1:EndDate></m1:EndDate>
          <m1:DisconnectionDate />
          <m1:OrderTotal />
          <m1:OrderCurrency />
          <m1:DisconnectionRequested />
          <m1:BillingCharged>N</m1:BillingCharged>
          <m1:OrderChannel />
          <m1:OrderTypeCode />
          <m1:OrderSubTypeCode />
          <m1:OrderReason />
 <m1:ListOfAttributes>
 
	<m1:Attribute><m1:ActionCode>Update</m1:ActionCode><m1:Name>PricingFlexibilityFlag</m1:Name><m1:Value>N</m1:Value></m1:Attribute>
 </m1:ListOfAttributes>
        </m1:Product>
      </m:AssetComponentIN>
    </m:assetComponent>
</soapenv:Body>
</soapenv:Envelope>	
